<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <!-- Шрифты -->
    <!-- <link rel="stylesheet" href="./assets/fonts/stylesheet.css"> -->
    <link rel="preconnect" href="https://fonts.googleapis.com">
    <link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
    <link
        href="https://fonts.googleapis.com/css2?family=Inter:ital,opsz,wght@0,14..32,100..900;1,14..32,100..900&display=swap"
        rel="stylesheet">
    <!-- swiper -->
    <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/swiper@8/swiper-bundle.min.css" />
    <!-- fontawesome -->

    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.1.2/css/all.min.css">
    <!-- Bootstrap -->
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.2.0/dist/css/bootstrap.min.css" rel="stylesheet"
          integrity="sha384-gH2yIJqKdNHPEq0n4Mqa/HGKIhSkIHeL5AyhkYV8i59U5AR6csBvApHHNl/vI1Bx" crossorigin="anonymous">
    <!-- Css -->
    <link rel="stylesheet" href="<?php echo get_template_directory_uri() ?>/assets/css/main.css">
    <title>Housing</title>
    <?php wp_head(); ?>
</head>

<body <?php body_class(); ?>>
<?php wp_body_open(); ?>

<div class="wrapper">

    <!-- header -->
    <header class="header" id="header">
        <div class="container">
            <div class="header_block d-flex justify-content-between align-items-center">
                <div class="header_logo">
                    <a href="<?php echo home_url(); ?>" class="d-flex align-items-center gap-3">
                        <?php
                        $logo = get_field('site_logo', 'option');
                        if( $logo ): ?>
                            <img style="width: 40px" src="<?php echo esc_url($logo['url']); ?>" alt="logo">
                        <?php endif; ?>
                        <span class="flex-wrap"><?= get_field('navbar_title', 'option') ?></span>
                    </a>

                </div>
                <!-- hamburger_mobile -->
                <div class="hamburger_menu d-lg-none">
                    <a href="#">
                        <svg xmlns="http://www.w3.org/2000/svg" width="13" height="7" viewBox="0 0 13 7"
                             fill="none">
                            <path d="M1 0.914062H12" stroke="black" stroke-linecap="round" />
                            <path d="M1 6.08984H12" stroke="black" stroke-linecap="round" />
                        </svg>
                    </a>
                </div>

                <ul class="header_menus d-flex align-content-center">
                    <?php
                    wp_nav_menu([
                        'theme_location' => 'header_menu',
                        'container' => false,
                        'menu_class' => '', // ul tagga class berish kerak bo‘lsa shu yerga yozasiz
                        'items_wrap' => '%3$s', // bu format sizga kerakli <li><a>...</a></li> formatni beradi
                    ]);
                    ?>
                </ul>
                <?php
                $phone = get_field('phones', 'option')[0]['phone'];
                $tel_clean = preg_replace('/[^0-9+]/', '', $phone); // raqamni tel: formatiga moslashtirish

                $start_time = get_field('schedule', 'option')['start_time'];
                $end_time = get_field('schedule', 'option')['end_time'];
                ?>

                <div class="header_socials d-flex">
                    <?php if ($phone): ?>
                        <a href="tel:<?php echo esc_attr($tel_clean); ?>">
                            <!-- Phone Icon -->
                            <svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15"
                                 fill="none">
                                <path
                                        d="M0.758462 5.97855C2.50759 9.78903 5.61494 12.8092 9.47233 14.4479L10.0918 14.7241C10.7777 15.0298 11.5494 15.0833 12.271 14.8754C12.9926 14.6675 13.6176 14.2114 14.036 13.5875L14.8458 12.3807C14.9726 12.1915 15.0239 11.9616 14.9896 11.7364C14.9554 11.5112 14.8381 11.3069 14.6609 11.1639L11.9172 8.94904C11.8217 8.87195 11.7116 8.81499 11.5934 8.78156C11.4753 8.74813 11.3517 8.73893 11.23 8.75451C11.1082 8.77009 10.9909 8.81012 10.885 8.87222C10.7791 8.93431 10.6868 9.01717 10.6137 9.11584L9.76473 10.2616C7.58545 9.1846 5.82147 7.41923 4.74556 5.23844L5.88968 4.38894C5.98828 4.31581 6.0711 4.22349 6.13315 4.11753C6.1952 4.01157 6.23522 3.89415 6.25079 3.77233C6.26636 3.65051 6.25716 3.52679 6.22375 3.40862C6.19034 3.29044 6.13341 3.18024 6.05638 3.08463L3.84284 0.339274C3.69991 0.16195 3.49581 0.0446078 3.27072 0.010361C3.04564 -0.0238857 2.8159 0.0274464 2.62676 0.154245L1.4125 0.969101C0.785243 1.39 0.327678 2.02004 0.12132 2.74699C-0.0850375 3.47393 -0.0267872 4.25058 0.285694 4.93856L0.758462 5.97855Z"
                                        fill="#A5D574" />
                            </svg>
                            <span><?php echo esc_html($phone); ?></span>
                        </a>
                    <?php endif; ?>

                    <?php if ($start_time && $end_time): ?>
                        <a href="#">
                            <!-- Clock Icon -->
                            <svg xmlns="http://www.w3.org/2000/svg" width="17" height="18" viewBox="0 0 17 18"
                                 fill="none">
                                <path
                                        d="M10.2 9.81818H11.475V12.1255L13.549 13.2791L12.9115 14.3427L10.2 12.8373V9.81818ZM13.6 5.72727H1.7V14.7273H5.6695C5.304 13.9827 5.1 13.1482 5.1 12.2727C5.1 10.7538 5.72687 9.29701 6.84272 8.22293C7.95856 7.14886 9.47196 6.54545 11.05 6.54545C11.9595 6.54545 12.8265 6.74182 13.6 7.09364V5.72727ZM1.7 16.3636C1.24913 16.3636 0.81673 16.1912 0.497918 15.8844C0.179107 15.5775 0 15.1613 0 14.7273V3.27273C0 2.36455 0.7565 1.63636 1.7 1.63636H2.55V0H4.25V1.63636H11.05V0H12.75V1.63636H13.6C14.0509 1.63636 14.4833 1.80877 14.8021 2.11564C15.1209 2.42252 15.3 2.83874 15.3 3.27273V8.26364C16.354 9.29455 17 10.71 17 12.2727C17 13.7917 16.3731 15.2484 15.2573 16.3225C14.1414 17.3966 12.628 18 11.05 18C9.4265 18 7.956 17.3782 6.885 16.3636H1.7ZM11.05 8.30455C9.95665 8.30455 8.90807 8.72262 8.13495 9.4668C7.36183 10.211 6.9275 11.2203 6.9275 12.2727C6.9275 14.4655 8.772 16.2409 11.05 16.2409C11.5914 16.2409 12.1274 16.1383 12.6276 15.9388C13.1278 15.7394 13.5822 15.4471 13.965 15.0787C14.3479 14.7102 14.6515 14.2727 14.8587 13.7913C15.0659 13.3098 15.1725 12.7938 15.1725 12.2727C15.1725 10.08 13.328 8.30455 11.05 8.30455Z"
                                        fill="#A5D574" />
                            </svg>
                            <span><?php echo esc_html($start_time); ?> - <?php echo esc_html($end_time); ?></span>
                        </a>
                    <?php endif; ?>
                </div>

            </div>
        </div>
        <div class="mobile_menus d-sm-none">
            <ul class="d-flex flex-column">
                <li><a href="#">Главная</a></li>
                <li><a href="#">Новости</a></li>
            </ul>
            <div class="mobile_socials d-flex justify-content-between">
                <div class="socials_left">
                    <a href="#" class="mobile_tel d-flex">
                        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="20" viewBox="0 0 20 20"
                             fill="none">
                            <path
                                d="M1.01128 7.9714C3.34345 13.052 7.48658 17.0789 12.6298 19.2639L13.4557 19.6322C14.3703 20.0397 15.3993 20.1111 16.3613 19.8339C17.3234 19.5566 18.1568 18.9485 18.7147 18.1167L19.7945 16.5076C19.9634 16.2553 20.0318 15.9488 19.9862 15.6485C19.9406 15.3482 19.7842 15.0759 19.5479 14.8852L15.8897 11.932C15.7622 11.8293 15.6154 11.7533 15.4579 11.7087C15.3005 11.6642 15.1356 11.6519 14.9733 11.6727C14.8109 11.6934 14.6545 11.7468 14.5133 11.8296C14.3721 11.9124 14.2491 12.0229 14.1516 12.1544L13.0196 13.6821C10.1139 12.2461 7.76196 9.89231 6.32741 6.98458L7.8529 5.85193C7.98437 5.75441 8.09479 5.63132 8.17753 5.49004C8.26027 5.34875 8.31362 5.1922 8.33438 5.02977C8.35514 4.86734 8.34288 4.70239 8.29834 4.54482C8.25379 4.38725 8.17788 4.24032 8.07517 4.11284L5.12378 0.452366C4.93322 0.215934 4.66108 0.059477 4.36097 0.0138147C4.06086 -0.0318475 3.75454 0.0365952 3.50235 0.205661L1.88334 1.29213C1.04699 1.85333 0.436905 2.69339 0.161761 3.66265C-0.113383 4.63191 -0.0357163 5.66743 0.380926 6.58475L1.01128 7.9714Z"
                                fill="black" />
                        </svg>
                        <div class="phone_numbers d-flex gap-1 flex-column">
                            <span class="mobile_text">8 (888) 888 88 88</span>
                            <span class="mobile_text">8 (888) 888 88 88</span>
                        </div>
                    </a>
                    <a href="#" class="mobile_mail d-flex align-items-center">
                        <svg xmlns="http://www.w3.org/2000/svg" width="22" height="16" viewBox="0 0 22 16"
                             fill="none">
                            <path
                                d="M19.8 0H2.2C0.99 0 0.011 0.9 0.011 2L0 14C0 15.1 0.99 16 2.2 16H19.8C21.01 16 22 15.1 22 14V2C22 0.9 21.01 0 19.8 0ZM19.36 4.25L11.583 8.67C11.231 8.87 10.769 8.87 10.417 8.67L2.64 4.25C2.5297 4.19371 2.43311 4.11766 2.35608 4.02645C2.27904 3.93525 2.22317 3.83078 2.19183 3.71937C2.1605 3.60796 2.15435 3.49194 2.17377 3.37831C2.19319 3.26468 2.23777 3.15581 2.30481 3.0583C2.37185 2.96079 2.45996 2.87666 2.5638 2.811C2.66764 2.74533 2.78506 2.69951 2.90895 2.6763C3.03283 2.65309 3.16061 2.65297 3.28455 2.67595C3.40849 2.69893 3.52601 2.74453 3.63 2.81L11 7L18.37 2.81C18.474 2.74453 18.5915 2.69893 18.7155 2.67595C18.8394 2.65297 18.9672 2.65309 19.0911 2.6763C19.2149 2.69951 19.3324 2.74533 19.4362 2.811C19.54 2.87666 19.6282 2.96079 19.6952 3.0583C19.7622 3.15581 19.8068 3.26468 19.8262 3.37831C19.8456 3.49194 19.8395 3.60796 19.8082 3.71937C19.7768 3.83078 19.721 3.93525 19.6439 4.02645C19.5669 4.11766 19.4703 4.19371 19.36 4.25Z"
                                fill="black" />
                        </svg>
                        <span class="mobile_text">email@yandex.ru</span>
                    </a>
                    <a href="#" class="mobile_location d-flex align-items-center">
                        <svg xmlns="http://www.w3.org/2000/svg" width="19" height="24" viewBox="0 0 19 24"
                             fill="none">
                            <path fill-rule="evenodd" clip-rule="evenodd"
                                  d="M9.89086 23.8785L9.89357 23.8772L9.90036 23.8725L9.92072 23.8572L10.0008 23.8005C10.0695 23.7512 10.1668 23.6792 10.2926 23.5845C10.5423 23.3965 10.8965 23.1198 11.3193 22.7645C12.429 21.8326 13.4667 20.8209 14.4237 19.7377C16.6684 17.187 19 13.5469 19 9.3842C19 6.89748 17.9998 4.51076 16.2192 2.75072C15.3392 1.87957 14.2924 1.18805 13.1393 0.715963C11.9861 0.243876 10.7493 0.000552409 9.5 0C8.25077 0.000465085 7.01398 0.243684 5.86081 0.715655C4.70764 1.18763 3.66088 1.87903 2.78079 2.75006C0.998654 4.51424 -0.000975045 6.8993 7.13672e-07 9.38486C7.13672e-07 13.5469 2.33157 17.187 4.57629 19.7377C5.53332 20.8209 6.571 21.8326 7.68075 22.7645C8.10418 23.1198 8.45772 23.3965 8.70743 23.5845C8.82993 23.6772 8.95367 23.7683 9.07861 23.8578L9.10032 23.8725L9.10643 23.8772L9.10914 23.8785C9.34325 24.0405 9.65675 24.0405 9.89086 23.8785ZM12.8929 9.33353C12.8929 10.2176 12.5354 11.0655 11.8991 11.6906C11.2628 12.3157 10.3998 12.6669 9.5 12.6669C8.60016 12.6669 7.73717 12.3157 7.10089 11.6906C6.4646 11.0655 6.10714 10.2176 6.10714 9.33353C6.10714 8.44945 6.4646 7.60159 7.10089 6.97646C7.73717 6.35132 8.60016 6.00012 9.5 6.00012C10.3998 6.00012 11.2628 6.35132 11.8991 6.97646C12.5354 7.60159 12.8929 8.44945 12.8929 9.33353Z"
                                  fill="black" />
                        </svg>
                        <span class="mobile_text">Ул. Карбышева 100 </span>
                    </a>
                </div>
                <div class="socials_right">
                    <a href="#" class="mobile_date d-flex align-items-center">
                        <svg xmlns="http://www.w3.org/2000/svg" width="22" height="24" viewBox="0 0 22 24"
                             fill="none">
                            <path
                                d="M13.2 13.0909H14.85V16.1673L17.534 17.7055L16.709 19.1236L13.2 17.1164V13.0909ZM17.6 7.63636H2.2V19.6364H7.337C6.864 18.6436 6.6 17.5309 6.6 16.3636C6.6 14.3383 7.41125 12.396 8.85528 10.9639C10.2993 9.53182 12.2578 8.72727 14.3 8.72727C15.477 8.72727 16.599 8.98909 17.6 9.45818V7.63636ZM2.2 21.8182C1.61652 21.8182 1.05694 21.5883 0.644365 21.1791C0.231785 20.77 0 20.215 0 19.6364V4.36364C0 3.15273 0.979 2.18182 2.2 2.18182H3.3V0H5.5V2.18182H14.3V0H16.5V2.18182H17.6C18.1835 2.18182 18.7431 2.41169 19.1556 2.82086C19.5682 3.23003 19.8 3.78498 19.8 4.36364V11.0182C21.164 12.3927 22 14.28 22 16.3636C22 18.3889 21.1888 20.3313 19.7447 21.7634C18.3007 23.1955 16.3422 24 14.3 24C12.199 24 10.296 23.1709 8.91 21.8182H2.2ZM14.3 11.0727C12.8851 11.0727 11.5281 11.6302 10.5276 12.6224C9.52708 13.6146 8.965 14.9604 8.965 16.3636C8.965 19.2873 11.352 21.6545 14.3 21.6545C15.0006 21.6545 15.6943 21.5177 16.3416 21.2518C16.9889 20.9859 17.577 20.5962 18.0724 20.1049C18.5678 19.6136 18.9608 19.0303 19.2289 18.3884C19.497 17.7465 19.635 17.0584 19.635 16.3636C19.635 13.44 17.248 11.0727 14.3 11.0727Z"
                                fill="black" />
                        </svg>
                        <span class="mobile_text">08:00 - 20:00</span>
                    </a>
                </div>
            </div>
            <div class="mobile_bottom d-flex align-items-center justify-content-between">
                <div class="mobile_bottom_left">
                    <p>Юридический адрес:</p>
                    <p>Почтовый адрес:</p>
                    <p>Сведения о регистрации:</p>
                </div>
                <div class="mobile_bottom_right">
                    <a href="#" class="tg_social">
                        <svg xmlns="http://www.w3.org/2000/svg" width="25" height="22" viewBox="0 0 25 22"
                             fill="none">
                            <path
                                d="M22.8686 0.194222C22.8686 0.194222 25.1813 -0.758063 24.9886 1.55463C24.9244 2.50693 24.3462 5.83993 23.8965 9.44503L22.3547 20.1243C22.3547 20.1243 22.2263 21.6887 21.0699 21.9608C19.9135 22.2329 18.1791 21.0085 17.8578 20.7364C17.6008 20.5324 13.0398 17.4714 11.4337 15.975C10.984 15.5669 10.4701 14.7506 11.4979 13.7983L18.2433 6.99631C19.0142 6.18005 19.7851 4.27548 16.573 6.58818L7.57923 13.0501C7.57923 13.0501 6.55137 13.7303 4.62417 13.1182L0.448465 11.7577C0.448465 11.7577 -1.09333 10.7374 1.54057 9.71708C7.96471 6.5201 15.8664 3.25512 22.8686 0.194222Z"
                                fill="black" />
                        </svg>
                    </a>
                </div>
            </div>
            <div class="mobile_desc_item">
                <p>Ярославская обл., г. Рыбинск, ул. Черняховского д. 8</p>
                <p>152914, Ярославская обл., г. Рыбинск, ул. Черняховского д. 8</p>
                <p>ОГРН: 1097610001610 зарегистрирован 16.09.2009 в Межрайонной инспекции ФНС №3 по
                    Ярославской области <a
                        href="http://xn----dtbmifbdg0a6ap.xn--p1ai/images/documents/svid_ogrn_800_600.jpg">(свидетельство
                        о регистрации)</a></p>
            </div>
        </div>
    </header>